zephyrproject-rtos/zephyr/drivers/can/can_stm32.c
/*
 * Copyright (c) 2018 Alexander Wachter
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <drivers/clock_control/stm32_clock_control.h>
#include <drivers/clock_control.h>
#include <pinmux/stm32/pinmux_stm32.h>
#include <sys/util.h>
#include <string.h>
#include <kernel.h>
#include <soc.h>
#include <errno.h>
#include <stdbool.h>
#include <drivers/can.h>

#include "can_stm32.h"

#include <logging/log.h>
LOG_MODULE_DECLARE(can_driver, CONFIG_CAN_LOG_LEVEL);

#define CAN_INIT_TIMEOUT  (10U * sys_clock_hw_cycles_per_sec() / MSEC_PER_SEC)

/*
 * CAN1 and CAN2 share filters
 * To use CAN2 the filters in CAN1 are needed, and for this to work
 * CAN1 needs to be clocked.
 * To make sure this is the case only allow CAN2 when CAN1 is also
 * enabled.
 */
#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(can2), st_stm32_can, okay)
#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(can1), st_stm32_can, disabled)
#error "CAN2 needs CAN1 for filtering"
#endif
#endif

/*
 * Global mutex for accessing the shared filter data.
 */
K_MUTEX_DEFINE(can_stm32_filter_mutex);

static inline void can_stm32_lock_filters(CAN_TypeDef *can)
{
	k_mutex_lock(&can_stm32_filter_mutex, K_FOREVER);

	/* Initialisation mode for the filter, this blocks CAN reception */
	can->FMR |= CAN_FMR_FINIT;
}

static inline void can_stm32_unlock_filters(CAN_TypeDef *can)
{
	/* Leave the initialisation mode for the filter */
	can->FMR &= ~CAN_FMR_FINIT;

	k_mutex_unlock(&can_stm32_filter_mutex);
}

static void can_stm32_signal_tx_complete(struct can_mailbox *mb)
{
	if (mb->tx_callback) {
		mb->tx_callback(mb->error_flags, mb->callback_arg);
	} else  {
		k_sem_give(&mb->tx_int_sem);
	}
}

static void can_stm32_get_msg_fifo(CAN_FIFOMailBox_TypeDef *mbox,
				    struct zcan_frame *msg)
{
	if (mbox->RIR & CAN_RI0R_IDE) {
		msg->ext_id = mbox->RIR >> CAN_RI0R_EXID_Pos;
		msg->id_type = CAN_EXTENDED_IDENTIFIER;
	} else {
		msg->std_id =  mbox->RIR >> CAN_RI0R_STID_Pos;
		msg->id_type = CAN_STANDARD_IDENTIFIER;
	}

	msg->rtr = mbox->RIR & CAN_RI0R_RTR ? CAN_REMOTEREQUEST : CAN_DATAFRAME;
	msg->dlc = mbox->RDTR & (CAN_RDT0R_DLC >> CAN_RDT0R_DLC_Pos);
	msg->data_32[0] = mbox->RDLR;
	msg->data_32[1] = mbox->RDHR;
#ifdef CONFIG_CAN_RX_TIMESTAMP
	msg->timestamp = ((mbox->RDTR & CAN_RDT0R_TIME) >> CAN_RDT0R_TIME_Pos);
#endif
}

static inline uint32_t can_stm32_get_rfxr(CAN_TypeDef *can, uint32_t fifo_nr)
{
	return fifo_nr == 0U ? can->RF0R : can->RF1R;
}

static inline void can_stm32_set_rfxr(CAN_TypeDef *can, uint32_t fifo_nr,
				      uint32_t value)
{
	if (fifo_nr == 0U) {
		can->RF0R = value;
	} else {
		can->RF1R = value;
	}
}

static inline
void can_stm32_rx_isr_handler(const struct device *dev, uint32_t fifo_nr)
{
	const struct can_stm32_config *cfg = DEV_CFG(dev);
	struct can_stm32_data *data = DEV_DATA(dev);
	CAN_TypeDef *can = cfg->can;
	struct can_stm32_filter_data *filter_data = cfg->shared_filter_data;
	const uint32_t port_nr = cfg->port_nr;
	uint32_t rfxr;

	while ((rfxr = can_stm32_get_rfxr(can, fifo_nr)) & CAN_RF0R_FMP0) {
		uint32_t match_index;
		CAN_FIFOMailBox_TypeDef *mbox;

		if (rfxr & CAN_RF0R_FOVR0) {
			LOG_ERR("RX FIFO %d Overflow", fifo_nr);
		}

		mbox = &can->sFIFOMailBox[fifo_nr];
		match_index = (mbox->RDTR & CAN_RDT0R_FMI) >> CAN_RDT0R_FMI_Pos;

		match_index += filter_data->map_offset[port_nr][fifo_nr];

		if (match_index >= CAN_STM32_FILTER_COUNT) {
			LOG_ERR("CAN%d FIFO%d illegal filter_match_index %d\n",
							port_nr, fifo_nr,
							match_index);
		} else {
			uint32_t filter_nr;
			struct zcan_frame msg;
			struct can_stm32_filter *filter;

			filter_nr = filter_data->filter_map[match_index];

			__ASSERT_NO_MSG(filter_nr < CONFIG_CAN_MAX_FILTER);

			can_stm32_get_msg_fifo(mbox, &msg);

			filter = &(data->filters[filter_nr]);

			if (filter->rx_cb) {
				filter->rx_cb(&msg, filter->cb_arg);
			}
		}

		/* Release message */
		rfxr |= CAN_RF0R_RFOM0;

		can_stm32_set_rfxr(can, fifo_nr, rfxr);
	}
}

static inline void can_stm32_bus_state_change_isr(const struct device *dev)
{
	const struct can_stm32_config *cfg = DEV_CFG(dev);
	struct can_stm32_data *data = DEV_DATA(dev);
	CAN_TypeDef *can = cfg->can;

	struct can_bus_err_cnt err_cnt;
	enum can_state state;

	if (!(can->ESR & CAN_ESR_EPVF) && !(can->ESR & CAN_ESR_BOFF)) {
		return;
	}

	err_cnt.tx_err_cnt = ((can->ESR & CAN_ESR_TEC) >> CAN_ESR_TEC_Pos);
	err_cnt.rx_err_cnt = ((can->ESR & CAN_ESR_REC) >> CAN_ESR_REC_Pos);

	if (can->ESR & CAN_ESR_BOFF) {
		state = CAN_BUS_OFF;
	} else if (can->ESR & CAN_ESR_EPVF) {
		state = CAN_ERROR_PASSIVE;
	} else {
		state = CAN_ERROR_ACTIVE;
	}

	if (data->state_change_isr) {
		data->state_change_isr(state, err_cnt);
	}
}

static inline
void can_stm32_tx_isr_handler(const struct device *dev)
{
	const struct can_stm32_config *cfg = DEV_CFG(dev);
	struct can_stm32_data *data = DEV_DATA(dev);
	CAN_TypeDef *can = cfg->can;

	uint32_t bus_off;

	bus_off = can->ESR & CAN_ESR_BOFF;

	if ((can->TSR & CAN_TSR_RQCP0) | bus_off) {
		data->mb0.error_flags =
				can->TSR & CAN_TSR_TXOK0 ? CAN_TX_OK  :
				can->TSR & CAN_TSR_TERR0 ? CAN_TX_ERR :
				can->TSR & CAN_TSR_ALST0 ? CAN_TX_ARB_LOST :
						 bus_off ? CAN_TX_BUS_OFF :
							   CAN_TX_UNKNOWN;
		/* clear the request. */
		can->TSR |= CAN_TSR_RQCP0;
		can_stm32_signal_tx_complete(&data->mb0);
	}

	if ((can->TSR & CAN_TSR_RQCP1) | bus_off) {
		data->mb1.error_flags =
				can->TSR & CAN_TSR_TXOK1 ? CAN_TX_OK  :
				can->TSR & CAN_TSR_TERR1 ? CAN_TX_ERR :
				can->TSR & CAN_TSR_ALST1 ? CAN_TX_ARB_LOST :
				bus_off                  ? CAN_TX_BUS_OFF :
							   CAN_TX_UNKNOWN;
		/* clear the request. */
		can->TSR |= CAN_TSR_RQCP1;
		can_stm32_signal_tx_complete(&data->mb1);
	}

	if ((can->TSR & CAN_TSR_RQCP2) | bus_off) {
		data->mb2.error_flags =
				can->TSR & CAN_TSR_TXOK2 ? CAN_TX_OK  :
				can->TSR & CAN_TSR_TERR2 ? CAN_TX_ERR :
				can->TSR & CAN_TSR_ALST2 ? CAN_TX_ARB_LOST :
				bus_off                  ? CAN_TX_BUS_OFF :
							   CAN_TX_UNKNOWN;
		/* clear the request. */
		can->TSR |= CAN_TSR_RQCP2;
		can_stm32_signal_tx_complete(&data->mb2);
	}

