zephyrproject-rtos/zephyr/drivers/can/can_stm32.c
	uint32_t fr1 = can->sFilterRegister[bank_nr].FR1;
	uint32_t fr2 = can->sFilterRegister[bank_nr].FR2;

	switch (*bank_offset) {
	case 0:
		*std_id = fr1 & 0xFFFF;
		*std_mask = (fr1 >> 16U) & 0xFFFF;
		break;

	case 2:
		*std_id = fr2 & 0xFFFF;
		*std_mask = (fr2 >> 16U) & 0xFFFF;
		break;

	default:
		return -1;
	}

	*bank_offset += 2;

	return 0;
}

static inline int can_stm32_get_filter_ext(CAN_TypeDef *can, uint32_t bank_nr,
					   uint32_t *bank_offset,
					   uint32_t *ext_id)
{
	if (bank_nr >= CAN_STM32_FILTER_BANK_COUNT) {
		return -1;
	}

	switch (*bank_offset) {
	case 0:
		*ext_id = can->sFilterRegister[bank_nr].FR1;
		break;

	case 2:
		*ext_id = can->sFilterRegister[bank_nr].FR2;
		break;

	default:
		return -1;
	}

	*bank_offset += 2;

	return 0;
}

static inline int can_stm32_get_filter_ext_mask(CAN_TypeDef *can,
						uint32_t bank_nr,
						uint32_t *bank_offset,
						uint32_t *ext_id,
						uint32_t *ext_mask)
{
	if (bank_nr >= CAN_STM32_FILTER_BANK_COUNT) {
		return -1;
	}

	*ext_id = can->sFilterRegister[bank_nr].FR1;
	*ext_mask = can->sFilterRegister[bank_nr].FR2;

	*bank_offset += 4;

	return 0;
}

static inline int can_stm32_get_filter(CAN_TypeDef *can, uint32_t bank_nr,
				       uint32_t *bank_offset,
				       enum can_filter_type filter_type,
				       uint32_t *id, uint32_t *mask)
{
	switch (filter_type) {
	case CAN_FILTER_EXTENDED_MASKED:
		return can_stm32_get_filter_ext_mask(can, bank_nr,
						     bank_offset, id, mask);

	case CAN_FILTER_EXTENDED:
		return can_stm32_get_filter_ext(can, bank_nr, bank_offset, id);

	case CAN_FILTER_STANDARD_MASKED:
		return can_stm32_get_filter_std_mask(can, bank_nr,
						     bank_offset, id, mask);

	case CAN_FILTER_STANDARD:
		return can_stm32_get_filter_std(can, bank_nr, bank_offset, id);

	default:
		return -1;
	}

	return 0;
}

static inline int can_stm32_set_filter_std(CAN_TypeDef *can, uint32_t bank_nr,
					   uint32_t *bank_offset,
					   uint32_t std_id)
{
	if (bank_nr >= CAN_STM32_FILTER_BANK_COUNT) {
		return -1;
	}

	uint32_t fr1 = can->sFilterRegister[bank_nr].FR1;
	uint32_t fr2 = can->sFilterRegister[bank_nr].FR2;

	switch (*bank_offset) {
	case 0U:
		can->sFilterRegister[bank_nr].FR1 =
				(fr1 & 0xFFFF0000) | (std_id & 0xFFFF);
		break;

	case 1U:
		can->sFilterRegister[bank_nr].FR1 =
				(fr1 & 0x0000FFFF) | ((std_id & 0xFFFF) << 16U);
		break;

	case 2U:
		can->sFilterRegister[bank_nr].FR2 =
				(fr2 & 0xFFFF0000) | (std_id & 0xFFFF);
		break;

	case 3U:
		can->sFilterRegister[bank_nr].FR2 =
				(fr2 & 0x0000FFFF) | ((std_id & 0xFFFF) << 16U);
		break;

	default:
		return -1;
	}

	*bank_offset += 1U;

	return 0;
}

static inline int can_stm32_set_filter_std_mask(CAN_TypeDef *can,
						uint32_t bank_nr,
						uint32_t *bank_offset,
						uint32_t std_id,
						uint32_t std_mask)
{
	if (bank_nr >= CAN_STM32_FILTER_BANK_COUNT) {
		return -1;
	}

	switch (*bank_offset) {
	case 0U:
		can->sFilterRegister[bank_nr].FR1 =
			((std_mask & 0xFFFF) << 16U) | (std_id & 0xFFFF);
		break;

	case 2U:
		can->sFilterRegister[bank_nr].FR2 =
			((std_mask & 0xFFFF) << 16U) | (std_id & 0xFFFF);
		break;

	default:
		return -1;

	}

	*bank_offset += 2U;

	return 0;
}

static inline int can_stm32_set_filter_ext(CAN_TypeDef *can, uint32_t bank_nr,
					   uint32_t *bank_offset,
					   uint32_t ext_id)
{
	if (bank_nr >= CAN_STM32_FILTER_BANK_COUNT) {
		return -1;
	}

	switch (*bank_offset) {
	case 0U:
		can->sFilterRegister[bank_nr].FR1 = ext_id;
		break;

	case 2U:
		can->sFilterRegister[bank_nr].FR2 = ext_id;
		break;

	default:
		return -1;
	}

	*bank_offset += 2U;

	return 0;
}

static inline int can_stm32_set_filter_ext_mask(CAN_TypeDef *can,
						uint32_t bank_nr,
						uint32_t *bank_offset,
						uint32_t ext_id,
						uint32_t ext_mask)
{
	if (bank_nr >= CAN_STM32_FILTER_BANK_COUNT) {
		return -1;
	}

	can->sFilterRegister[bank_nr].FR1 = ext_id;
	can->sFilterRegister[bank_nr].FR2 = ext_mask;

	*bank_offset += 4U;

	return 0;
}


static inline int can_stm32_set_filter(CAN_TypeDef *can, uint32_t bank_nr,
				       uint32_t *bank_offset,
				       enum can_filter_type filter_type,
				       uint32_t id, uint32_t mask)
{
	switch (filter_type) {
	case CAN_FILTER_EXTENDED_MASKED:
		return can_stm32_set_filter_ext_mask(can, bank_nr,
						     bank_offset, id, mask);

	case CAN_FILTER_EXTENDED:
		return can_stm32_set_filter_ext(can, bank_nr, bank_offset, id);

	case CAN_FILTER_STANDARD_MASKED:
		return can_stm32_set_filter_std_mask(can, bank_nr,
						     bank_offset, id, mask);

	case CAN_FILTER_STANDARD:
		return can_stm32_set_filter_std(can, bank_nr, bank_offset, id);

	default:
		return -1;
	}

	return 0;
}

static int can_stm32_update_filter_banks_entry_fill(const struct device *dev,
					enum can_filter_type filter_type,
					uint32_t *bank_nr,
					uint32_t *bank_offset,
					uint32_t *filter_map_offset)
{
	const struct can_stm32_config *cfg = DEV_CFG(dev);
	struct can_stm32_filter_data *filter_data = cfg->shared_filter_data;
	CAN_TypeDef *master_can = cfg->master_can;

	uint32_t prev_id = 0;
	uint32_t prev_mask = 0;
	uint32_t read_bank_offset = 0;

	if (*bank_offset == 0) {
		return 0;
	}

	read_bank_offset = *bank_offset - 1;
	can_stm32_get_filter(master_can, *bank_nr, &read_bank_offset,
			     filter_type, &prev_id, &prev_mask);

	while (*bank_offset < 4) {

		can_stm32_set_filter(master_can, *bank_nr, bank_offset,
				     filter_type, prev_id, prev_mask);

		if (*filter_map_offset >= CAN_STM32_FILTER_COUNT) {
			return -1;
		}

		filter_data->filter_map[*filter_map_offset] =
				filter_data->filter_map[*filter_map_offset - 1];
		*filter_map_offset += 1;
	}

	*bank_offset = 0;
	*bank_nr += 1;

	return 0;
}

static int can_stm32_update_filter_banks_entry(const struct device *dev,
					       uint32_t filter_nr,
					       uint32_t *bank_nr,
					       uint32_t *bank_offset,
					       uint32_t *filter_map_offset)
{
	struct can_stm32_data *data = DEV_DATA(dev);
	const struct can_stm32_config *cfg = DEV_CFG(dev);
	struct can_stm32_filter_data *filter_data = cfg->shared_filter_data;
	CAN_TypeDef *master_can = cfg->master_can;
	struct can_stm32_filter *filter;

	filter = &(data->filters[filter_nr]);

