zephyrproject-rtos/zephyr/drivers/can/can_stm32.c
	if (*bank_offset == 0U) {
		uint32_t bank_bitpos = (1U << (*bank_nr));

		if (filter->fifo_nr == 0U) {
			master_can->FFA1R &= ~bank_bitpos;
		} else {
			master_can->FFA1R |= bank_bitpos;
		}

		switch (filter->filter_type) {
		default:
			break;

		case CAN_FILTER_STANDARD:
			master_can->FS1R &= ~bank_bitpos; /* 16bit scale mode */
			master_can->FM1R |= bank_bitpos; /* id mode */
			break;

		case CAN_FILTER_STANDARD_MASKED:
			master_can->FS1R &= ~bank_bitpos; /* 16bit scale mode */
			master_can->FM1R &= ~bank_bitpos; /* mask mode */
			break;

		case CAN_FILTER_EXTENDED:
			master_can->FS1R |= bank_bitpos; /* 32bit scale mode */
			master_can->FM1R |= bank_bitpos; /* id mode */
			break;

		case CAN_FILTER_EXTENDED_MASKED:
			master_can->FS1R |= bank_bitpos;  /* 32bit scale mode */
			master_can->FM1R &= ~bank_bitpos; /* mask mode */
			break;
		}

		/* Filter bank activation */
		master_can->FA1R |= bank_bitpos;
	}

	can_stm32_set_filter(master_can, *bank_nr, bank_offset,
			     filter->filter_type, filter->filter_id,
			     filter->filter_mask);

	if (*filter_map_offset >= CAN_STM32_FILTER_COUNT) {
		return -1;
	}

	filter_data->filter_map[*filter_map_offset] = filter_nr;
	*filter_map_offset += 1U;

	if (*bank_offset == 4U) {
		*bank_offset = 0U;
		*bank_nr += 1U;
	}

	return 0;
}

static int can_stm32_update_filter_banks_type(const struct device *dev,
					      uint32_t fifo_nr,
					      enum can_filter_type filter_type,
					      uint32_t *bank_nr,
					      uint32_t *filter_map_offset)
{
	struct can_stm32_data *data = DEV_DATA(dev);
	struct can_stm32_filter *filter;
	int res;
	uint32_t filter_nr;
	uint32_t bank_offset;


	bank_offset = 0U;
	for (filter_nr = 0U; filter_nr < CONFIG_CAN_MAX_FILTER; ++filter_nr) {
		filter = &(data->filters[filter_nr]);

		if ((filter->rx_cb == NULL) ||
		    (filter->fifo_nr != fifo_nr) ||
		    (filter->filter_type != filter_type)) {
			continue;
		}

		res = can_stm32_update_filter_banks_entry(dev, filter_nr,
							  bank_nr, &bank_offset,
							  filter_map_offset);
		if (res < 0) {
			return res;
		}

	}

	res = can_stm32_update_filter_banks_entry_fill(dev, filter_type,
						       bank_nr, &bank_offset,
						       filter_map_offset);
	if (res < 0) {
		return res;
	}

	return 0;
}

static int can_stm32_update_filter_banks_fifo(const struct device *dev,
					      uint32_t fifo_nr,
					      uint32_t *bank_nr,
					      uint32_t *filter_map_offset)
{
	static const enum can_filter_type
	sort_order[CAN_STM32_FILTER_TYPE_COUNT] = {
		CAN_FILTER_EXTENDED,
		CAN_FILTER_STANDARD,
		CAN_FILTER_EXTENDED_MASKED,
		CAN_FILTER_STANDARD_MASKED,
	};

	uint32_t n;

	for (n = 0U; n < CAN_STM32_FILTER_TYPE_COUNT; ++n) {
		int res = can_stm32_update_filter_banks_type(dev, fifo_nr,
							 sort_order[n],
							 bank_nr,
							 filter_map_offset);
		if (res < 0) {
			return res;
		}
	}

	return 0;
}

/*
 * Update the filters for the selected port
 */
static int can_stm32_update_filter_banks_port(const struct device *dev,
					      uint32_t *bank_nr,
					      uint32_t *filter_map_offset)
{
	const struct can_stm32_config *cfg = DEV_CFG(dev);
	const uint32_t port_nr = cfg->port_nr;
	struct can_stm32_filter_data *filter_data = cfg->shared_filter_data;

	for (uint32_t fifo_nr = 0U; fifo_nr < CAN_STM32_FIFO_COUNT; fifo_nr++) {
		int res;

		filter_data->map_offset[port_nr][fifo_nr] = *filter_map_offset;

		res = can_stm32_update_filter_banks_fifo(dev, fifo_nr, bank_nr,
							 filter_map_offset);
		if (res < 0) {
			return res;
		}
	}

	return 0;
}

/*
 * Update all filter banks for both ports that share the filter banks.
 */
static int can_stm32_update_filter_banks(const struct device *dev)
{
	const struct can_stm32_config *cfg = DEV_CFG(dev);
	struct can_stm32_filter_data *filter = cfg->shared_filter_data;
	CAN_TypeDef *master_can = cfg->master_can;

	int res;
	uint32_t port_nr;
	uint32_t bank_nr = 0U;
	uint32_t filter_map_offset = 0U;

	/* Initialisation mode for the filter */
	master_can->FMR |= CAN_FMR_FINIT;

	res = can_stm32_reset_rx_filters(dev);
	if (res < 0) {
		return res;
	}

	for (port_nr = 0U; port_nr < CAN_STM32_SHARED_PORT_COUNT; port_nr++) {
		const struct device *d = filter->can_dev[port_nr];

		if (d != NULL) {
			res = can_stm32_update_filter_banks_port(d, &bank_nr,
							&filter_map_offset);
			if (res < 0) {
				return res;
			}
		} else {
			uint32_t fifo_nr = 0;

			for ( ; fifo_nr < CAN_STM32_FIFO_COUNT; fifo_nr++) {
				filter->map_offset[port_nr][fifo_nr] =
							filter_map_offset;
			}
		}

		if (port_nr == 0) {
			/* set start offset for port 2 filters */
			master_can->FMR |= ((bank_nr & 0x1F) << 8);
		}
	}

	/* Leave the initialisation mode for the filter */
	master_can->FMR &= ~CAN_FMR_FINIT;

	return 0;
}

static inline void can_stm32_convert_filter(struct can_stm32_filter *dst,
					    const struct zcan_filter *src)
{
	if (src->id_type == CAN_STANDARD_IDENTIFIER) {
		dst->filter_id = can_generate_std_id(src);

		if (src->std_id_mask != CAN_STD_ID_MASK) {
			dst->filter_mask = can_generate_std_mask(src);
			dst->filter_type = CAN_FILTER_STANDARD_MASKED;
		} else {
			dst->filter_mask = 0;
			dst->filter_type = CAN_FILTER_STANDARD;
		}
	} else {
		dst->filter_id = can_generate_ext_id(src);

		if (src->ext_id_mask != CAN_EXT_ID_MASK) {
			dst->filter_mask = can_generate_ext_mask(src);
			dst->filter_type = CAN_FILTER_EXTENDED_MASKED;
		} else {
			dst->filter_mask = 0;
			dst->filter_type = CAN_FILTER_EXTENDED;
		}
	}
}

static inline int can_stm32_add_filter(const struct device *dev,
				       can_rx_callback_t cb, void *cb_arg,
				       const struct zcan_filter *filter)
{
	struct can_stm32_data *data = DEV_DATA(dev);
	int filter_nr;

	for (filter_nr = 0; filter_nr < CONFIG_CAN_MAX_FILTER; filter_nr++) {
		struct can_stm32_filter *f = &data->filters[filter_nr];

		if (f->rx_cb == NULL) {
			f->rx_cb = cb;
			f->cb_arg = cb_arg;
			f->fifo_nr = filter_nr % 2;

			can_stm32_convert_filter(f, filter);

			return filter_nr;
		}
	}

	return -1;
}

static inline int can_stm32_remove_filter(const struct device *dev, int filter_nr)
{
	struct can_stm32_data *data = DEV_DATA(dev);

	if (filter_nr < 0 || filter_nr >= CONFIG_CAN_MAX_FILTER) {
		return -1;
	}

	data->filters[filter_nr].rx_cb = NULL;

