zephyrproject-rtos/zephyr/drivers/can/can_stm32.c
	return 0;
}

int can_stm32_attach_isr(const struct device *dev, can_rx_callback_t isr,
			 void *cb_arg,
			 const struct zcan_filter *filter)
{
	struct can_stm32_data *data = DEV_DATA(dev);
	const struct can_stm32_config *cfg = DEV_CFG(dev);
	int filter_nr;

	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	can_stm32_lock_filters(cfg->master_can);

	filter_nr = can_stm32_add_filter(dev, isr, cb_arg, filter);

	if (filter_nr >= 0) {

		if (can_stm32_update_filter_banks(dev) < 0) {
			can_stm32_remove_filter(dev, filter_nr);
			can_stm32_update_filter_banks(dev);
			filter_nr = -1;
		}
	}

	can_stm32_unlock_filters(cfg->master_can);

	k_mutex_unlock(&data->inst_mutex);

	return filter_nr;
}

void can_stm32_detach(const struct device *dev, int filter_nr)
{
	struct can_stm32_data *data = DEV_DATA(dev);
	const struct can_stm32_config *cfg = DEV_CFG(dev);

	__ASSERT_NO_MSG(filter_nr >= 0 && filter_nr < CONFIG_CAN_MAX_FILTER);

	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	can_stm32_lock_filters(cfg->master_can);

	can_stm32_remove_filter(dev, filter_nr);
	can_stm32_update_filter_banks(dev);

	can_stm32_unlock_filters(cfg->master_can);

	k_mutex_unlock(&data->inst_mutex);
}

static const struct can_driver_api can_api_funcs = {
	.configure = can_stm32_runtime_configure,
	.send = can_stm32_send,
	.attach_isr = can_stm32_attach_isr,
	.detach = can_stm32_detach,
	.get_state = can_stm32_get_state,
#ifndef CONFIG_CAN_AUTO_BUS_OFF_RECOVERY
	.recover = can_stm32_recover,
#endif
	.register_state_change_isr = can_stm32_register_state_change_isr
};

static struct can_stm32_filter_data can_stm32_shared_filter_data_1_2 = {};

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(can1), st_stm32_can, okay)

static void config_can_1_irq(CAN_TypeDef *can);

static const struct soc_gpio_pinctrl pins_can_1[] =
	ST_STM32_DT_PINCTRL(can1, 0);

static const struct can_stm32_config can_stm32_cfg_1 = {
	.can = (CAN_TypeDef *)DT_REG_ADDR(DT_NODELABEL(can1)),
	.master_can = (CAN_TypeDef *)DT_REG_ADDR(DT_NODELABEL(can1)),
	.shared_filter_data = &can_stm32_shared_filter_data_1_2,
	.bus_speed = DT_PROP(DT_NODELABEL(can1), bus_speed),
	.port_nr = 0,
	.sjw = DT_PROP(DT_NODELABEL(can1), sjw),
	.prop_ts1 = DT_PROP(DT_NODELABEL(can1), prop_seg) +
					DT_PROP(DT_NODELABEL(can1), phase_seg1),
	.ts2 = DT_PROP(DT_NODELABEL(can1), phase_seg2),
	.pclken = {
		.enr = DT_CLOCKS_CELL(DT_NODELABEL(can1), bits),
		.bus = DT_CLOCKS_CELL(DT_NODELABEL(can1), bus),
	},
	.config_irq = config_can_1_irq,
	.pinctrl = pins_can_1,
	.pinctrl_len = ARRAY_SIZE(pins_can_1)
};

static struct can_stm32_data can_stm32_dev_data_1;

DEVICE_AND_API_INIT(can_stm32_1, DT_LABEL(DT_NODELABEL(can1)), &can_stm32_init,
		    &can_stm32_dev_data_1, &can_stm32_cfg_1,
		    POST_KERNEL, CONFIG_KERNEL_INIT_PRIORITY_DEVICE,
		    &can_api_funcs);

static void config_can_1_irq(CAN_TypeDef *can)
{
	LOG_DBG("Enable CAN1 IRQ");
#ifdef CONFIG_SOC_SERIES_STM32F0X
	IRQ_CONNECT(DT_IRQN(DT_NODELABEL(can1)),
		    DT_IRQ(DT_NODELABEL(can1), priority),
		    can_stm32_isr, DEVICE_GET(can_stm32_1), 0U);
	irq_enable(DT_IRQN(DT_NODELABEL(can1)));
#else
	IRQ_CONNECT(DT_IRQ_BY_NAME(DT_NODELABEL(can1), rx0, irq),
		    DT_IRQ_BY_NAME(DT_NODELABEL(can1), rx0, priority),
		    can_stm32_rx0_isr, DEVICE_GET(can_stm32_1), 0U);
	irq_enable(DT_IRQ_BY_NAME(DT_NODELABEL(can1), rx0, irq));

	IRQ_CONNECT(DT_IRQ_BY_NAME(DT_NODELABEL(can1), rx1, irq),
		    DT_IRQ_BY_NAME(DT_NODELABEL(can1), rx1, priority),
		    can_stm32_rx1_isr, DEVICE_GET(can_stm32_1), 0U);
	irq_enable(DT_IRQ_BY_NAME(DT_NODELABEL(can1), rx1, irq));

	IRQ_CONNECT(DT_IRQ_BY_NAME(DT_NODELABEL(can1), tx, irq),
		    DT_IRQ_BY_NAME(DT_NODELABEL(can1), tx, priority),
		    can_stm32_tx_isr, DEVICE_GET(can_stm32_1), 0U);
	irq_enable(DT_IRQ_BY_NAME(DT_NODELABEL(can1), tx, irq));

	IRQ_CONNECT(DT_IRQ_BY_NAME(DT_NODELABEL(can1), sce, irq),
		    DT_IRQ_BY_NAME(DT_NODELABEL(can1), sce, priority),
		    can_stm32_state_change_isr, DEVICE_GET(can_stm32_1), 0U);
	irq_enable(DT_IRQ_BY_NAME(DT_NODELABEL(can1), sce, irq));
#endif
	can->IER |= CAN_IER_TMEIE | CAN_IER_ERRIE | CAN_IER_BOFIE |
		    CAN_IER_FMPIE0 | CAN_IER_FMPIE1;
}

#if defined(CONFIG_NET_SOCKETS_CAN)

#include "socket_can_generic.h"

static int socket_can_init_1(const struct device *dev)
{
	const struct device *can_dev = DEVICE_GET(can_stm32_1);
	struct socket_can_context *socket_context = dev->data;

	LOG_DBG("Init socket CAN device %p (%s) for dev %p (%s)",
		dev, dev->name, can_dev, can_dev->name);

	socket_context->can_dev = can_dev;
	socket_context->msgq = &socket_can_msgq;

	socket_context->rx_tid =
		k_thread_create(&socket_context->rx_thread_data,
				rx_thread_stack,
				K_KERNEL_STACK_SIZEOF(rx_thread_stack),
				rx_thread, socket_context, NULL, NULL,
				RX_THREAD_PRIORITY, 0, K_NO_WAIT);

	return 0;
}

NET_DEVICE_INIT(socket_can_stm32_1, SOCKET_CAN_NAME_1, socket_can_init_1,
		device_pm_control_nop, &socket_can_context_1, NULL,
		CONFIG_KERNEL_INIT_PRIORITY_DEVICE,
		&socket_can_api,
		CANBUS_RAW_L2, NET_L2_GET_CTX_TYPE(CANBUS_RAW_L2), CAN_MTU);

#endif /* CONFIG_NET_SOCKETS_CAN */

#endif /* DT_NODE_HAS_STATUS(DT_NODELABEL(can1), okay) */

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(can2), st_stm32_can, okay)

static void config_can_2_irq(CAN_TypeDef *can);

static const struct soc_gpio_pinctrl pins_can_2[] =
	ST_STM32_DT_PINCTRL(can2, 0);

static const struct can_stm32_config can_stm32_cfg_2 = {
	.can = (CAN_TypeDef *)DT_REG_ADDR(DT_NODELABEL(can2)),
	.master_can = (CAN_TypeDef *)DT_PROP(DT_NODELABEL(can2),
								master_can_reg),
	.shared_filter_data = &can_stm32_shared_filter_data_1_2,
	.bus_speed = DT_PROP(DT_NODELABEL(can2), bus_speed),
	.port_nr = 1,
	.sjw = DT_PROP(DT_NODELABEL(can2), sjw),
	.prop_ts1 = DT_PROP(DT_NODELABEL(can2), prop_seg) +
					DT_PROP(DT_NODELABEL(can2), phase_seg1),
	.ts2 = DT_PROP(DT_NODELABEL(can2), phase_seg2),
	.pclken = {
		.enr = DT_CLOCKS_CELL(DT_NODELABEL(can2), bits),
		.bus = DT_CLOCKS_CELL(DT_NODELABEL(can2), bus),
	},
	.config_irq = config_can_2_irq,
	.pinctrl = pins_can_2,
	.pinctrl_len = ARRAY_SIZE(pins_can_2)
};

